Revit 2026 API

# CurveElementLineStyle Property

---

The line style of this curve element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element LineStyle { get; set; }
```
```vb
Public Property LineStyle As Element
	Get
	Set
```
```cpp
public:
property Element^ LineStyle {
	Element^ get ();
	void set (Element^ value);
}
```
```fsharp
member LineStyle : Element with get, set
```

#### Property Value

Element

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |
| InvalidOperationException | Thrown when regeneration failed. -- or -- Thrown when fail to get line style. |

The return of this property will be a [!:Autodesk::Revit::DB::GraphicsStyle] element. These graphics styles should be associated to subcategories of the BuiltInCategory OST_Lines.

#### Reference

CurveElement Class

Autodesk.Revit.DB Namespace